app/controllers/api_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'value1' ORDER BY `users`.`id` ASC LIMIT 1
---
    def user_auth
        @user = User.where(email: params[:email]).first