app/controllers/users/sessions_controller.rb

  def create
    return redirect_to new_user_session_path unless user_exist?
    user = User.find_by(id: session[:temp_user_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1